DistrRTGenBinding.RequestHashToIndex.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="urn:DistrRTGen">
 <SOAP-ENV:Body>
  <ns1:RequestHashToIndex>
   <MachineInfo>
    <Credentials>
     <Username></Username>
     <Password></Password>
    </Credentials>
    <Version></Version>
    <Hostname></Hostname>
    <SupportHybrid>0</SupportHybrid>
    <CPU>
     <CPUElement>
      <Architecture></Architecture>
      <CurrentSpeed>0</CurrentSpeed>
      <MaxSpeed>0</MaxSpeed>
      <NumCores>0</NumCores>
     </CPUElement>
    </CPU>
    <ClientID>0</ClientID>
   </MachineInfo>
   <NumHashes>0</NumHashes>
   <RecievePublicHashes>0</RecievePublicHashes>
  </ns1:RequestHashToIndex>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
